; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v12)
             (pred_10 ?v10 ?v4)
             (pred_11 ?v6 ?v4)
             (pred_1 ?v2 ?v6 )
	     (pred_8 ?v6)
             (pred_4 ?v9)
             (pred_6 ?v10)
             (pred_5 ?v4)
             (pred_3 ?v6)
             (pred_9 ?v10)
             (pred_12 ?v6)
             (pred_2 ))



(:action op_3
:parameters (?v1 ?v7 ?v3 ?v5)
:precondition (and (pred_4 ?v1) (pred_4 ?v7) (pred_6 ?v3) (pred_5 ?v5)
          (pred_7 ?v1 ?v7) (pred_10 ?v3 ?v5)
                   (pred_11 ?v7 ?v5) (pred_8 ?v1) 
                   (pred_3 ?v7) (pred_9 ?v3))
:effect (and  (pred_12 ?v7) (not (pred_3 ?v7))))


(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_4 ?v1) (pred_4 ?v11)
               (pred_8 ?v1) (pred_7 ?v1 ?v11) (pred_12 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v1))))

(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_4 ?v1) (pred_6 ?v3) 
                  (pred_8 ?v1) (pred_1 ?v3 ?v1) (pred_2 ))
:effect (and (pred_9 ?v3)
   (not (pred_1 ?v3 ?v1)) (not (pred_2 ))))


(:action op_5
:parameters (?v1 ?v13 ?v8)
:precondition (and (pred_4 ?v1) (pred_6 ?v13) (pred_6 ?v8)
                  (pred_8 ?v1) (pred_9 ?v8) (pred_1 ?v13 ?v1))
:effect (and (pred_9 ?v13) (pred_1 ?v8 ?v1)
        (not (pred_9 ?v8)) (not (pred_1 ?v13 ?v1))))

(:action op_1
:parameters (?v1 ?v3)
:precondition (and (pred_4 ?v1) (pred_6 ?v3) 
                  (pred_8 ?v1) (pred_9 ?v3))
:effect (and (pred_2 ) (pred_1 ?v3 ?v1) (not (pred_9 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_04 obj_02 obj_18 obj_08 obj_07 obj_06 obj_14 obj_21 obj_15 obj_10 obj_20 obj_17 obj_03 obj_12 obj_11
    obj_19 obj_05
    obj_13 obj_01 obj_16
    )

    (:init
       (pred_2)

       (pred_4 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_07)
       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_21)
       (pred_4 obj_15)
       (pred_4 obj_10)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_05)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_6 obj_16)

       (pred_7 obj_09 obj_08)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_14 obj_20)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_14)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_03 obj_12)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_12)
       (pred_3 obj_07)
       (pred_3 obj_21)
       (pred_3 obj_02)
       (pred_11  obj_07 obj_19)
       (pred_11  obj_21 obj_05)
       (pred_11  obj_02 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_08)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_11)

       (pred_10  obj_13 obj_19)
       (pred_10  obj_01 obj_05)
       (pred_10  obj_16 obj_05)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_16 obj_12)
       (pred_8 obj_10)
    )

    (:goal (and
       (pred_1 obj_13 obj_15)
       (pred_1 obj_01 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_4 obj_10 obj_20)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_20)
   goals met: 0 of 2
2. (op_4 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 0 of 2
3. (op_2 obj_14 obj_01)
   deleted: (pred_1 obj_01 obj_14) (pred_2)
   added: (pred_9 obj_01)
   goals met: 0 of 2
4. (op_4 obj_14 obj_20)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_20)
   goals met: 0 of 2
5. (op_1 obj_20 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_2) (pred_1 obj_01 obj_20)
   goals met: 1 of 2
6. (op_4 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 1 of 2
7. (op_4 obj_14 obj_18)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_18)
   goals met: 1 of 2
8. (op_2 obj_18 obj_13)
   deleted: (pred_1 obj_13 obj_18) (pred_2)
   added: (pred_9 obj_13)
   goals met: 1 of 2
9. (op_4 obj_18 obj_14)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_14)
   goals met: 1 of 2
10. (op_4 obj_14 obj_20)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_20)
   goals met: 1 of 2
11. (op_4 obj_20 obj_10)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_10)
   goals met: 1 of 2
12. (op_4 obj_10 obj_15)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_15)
   goals met: 1 of 2
13. (op_1 obj_15 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_2) (pred_1 obj_13 obj_15)
   goals met: 2 of 2
